code/testing.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-25 Fri 00:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Tests</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="root" />
<link rel="stylesheet" type="text/css" href="/rpm.frontend/styles.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Tests</h1>

<div id="outline-container-org4341d93" class="outline-2">
<h2 id="org4341d93"><span class="section-number-2">1</span> End-to-end tests</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #a020f0;">ns</span> <span style="color: #228b22;">e2e.core</span>
  <span style="color: #8b2252;">"This namespace contains your e2e tests and is the entrypoint for 'yarn e2e'."</span>
  (<span style="color: #008b8b;">:require</span> [cljs.test <span style="color: #008b8b;">:refer-macros</span> [deftest is async use-fixtures]]
            [<span style="color: #8b2252;">"http"</span> <span style="color: #008b8b;">:as</span> http]
            [<span style="color: #8b2252;">"serve-handler"</span> <span style="color: #008b8b;">:as</span> serve-handler]
            [<span style="color: #8b2252;">"taiko"</span> <span style="color: #008b8b;">:refer</span> [openBrowser goto closeBrowser text diagnostics]]))

<span style="color: #b22222;">; </span><span style="color: #b22222;">Serve public/ on a static server.</span>
(use-fixtures
  <span style="color: #008b8b;">:once</span>
  (<span style="color: #a020f0;">let</span> [server (.createServer http #(serve-handler <span style="color: #a0522d;">%1</span> <span style="color: #a0522d;">%2</span> #js {<span style="color: #008b8b;">:public</span> <span style="color: #8b2252;">"public/"</span>}))]
    {<span style="color: #008b8b;">:before</span> #(.listen server 5000)
    <span style="color: #008b8b;">:after</span> #(.close server)}))

<span style="color: #b22222;">; </span><span style="color: #b22222;">Change debug to true to see the browser performing actions.</span>
(<span style="color: #a020f0;">def</span> <span style="color: #a0522d;">debug</span> <span style="color: #008b8b;">false</span>)
(<span style="color: #a020f0;">def</span> <span style="color: #a0522d;">browser-opts</span> (<span style="color: #a020f0;">if</span> debug
                    #js {<span style="color: #008b8b;">:headless</span> <span style="color: #008b8b;">false</span> <span style="color: #008b8b;">:observe</span> <span style="color: #008b8b;">true</span>}
                    #js {}))

(<span style="color: #a020f0;">deftest</span> <span style="color: #0000ff;">app-works</span>
  (<span style="color: #a020f0;">let</span> [test-string <span style="color: #8b2252;">"is running!"</span>]
    (async done
          (<span style="color: #a020f0;">-&gt;</span>
            (openBrowser browser-opts)
            (.then #(.logConsoleInfo diagnostics))
            (.then #(.on <span style="color: #a0522d;">%1</span> <span style="color: #8b2252;">"logEntry"</span> (<span style="color: #a020f0;">fn</span> [log] (is (not (= (.-level log) <span style="color: #8b2252;">"error"</span>))
                                                      (str <span style="color: #8b2252;">"Should not log errors: "</span>
                                                          (<span style="color: #228b22;">js</span>/JSON.stringify log))))))
            (.then #(goto <span style="color: #8b2252;">"http://localhost:5000"</span>))
            (.then #(.exists (text test-string)))
            (.then #(is <span style="color: #a0522d;">%</span> (str <span style="color: #8b2252;">"Text '"</span> test-string <span style="color: #8b2252;">"' should exist in page"</span>)))
            (.catch #(is <span style="color: #008b8b;">false</span> <span style="color: #8b2252;">"Should not have thrown errors"</span>))
            (.finally #(closeBrowser))
            (.then #(done))))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org39a4580" class="outline-2">
<h2 id="org39a4580"><span class="section-number-2">2</span> GitHub workflows</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-yaml"># DO NOT EDIT DIRECTLY!
# THIS FILE IS AUTOGENERATED FROM chapters/testing.org

name: Clojurescript tests

# Controls when the action will run.
on:
  push:
    branches: [ master ]

  # Allows you to run this workflow manually from the Actions tab
  workflow_dispatch:

# A workflow run is made up of one or more jobs that can run sequentially or in parallel
jobs:
  # This workflow contains a single job called "build"
  build:
    runs-on: ubuntu-latest

    steps:
      - name: No-op
        run: echo OK
      # # Checks-out your repository under $GITHUB_WORKSPACE, so your job can access it
      # - uses: actions/checkout@v2

      # - name: Run in $GITHUB_WORKSPACE
      #   run: cd $GITHUB_WORKSPACE

      # - name: Prepare java
      #   uses: actions/setup-java@v1
      #   with:
      #     java-version: 1.8

      # - name: Install Clojure CLI
      #   uses: DeLaGuardo/setup-clojure@3.4
      #   with:
      #     cli: 1.10.1.693

      # - name: Install Emacs
      #   run: sudo apt-get install -y emacs-nox

      # # TODO: Use something better suited for this than Emacs.
      # - name: Tangle source files
      #   run: |
      #     cd src
      #     echo "(dolist (file argv) (message file) (find-file file) (org-babel-tangle))" &gt; compile.el
      #     emacs --script compile.el *.org
      #     cd -

      # - name: Run Clojure tests
      #   run: clojure -X:test
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: root</p>
<p class="date">Created: 2021-06-25 Fri 00:16</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
